Ran Plan for project: `gitea` dir: `apps/gitea` workspace: `gitea`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # gitea_repository.this["flux-test"] will be destroyed
- resource "gitea_repository" "this" {
      - allow_manual_merge          = true -> null
      - allow_merge_commits         = true -> null
      - allow_rebase                = true -> null
      - allow_rebase_explicit       = true -> null
      - allow_squash_merge          = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - autodetect_manual_merge     = true -> null
      - clone_url                   = "https://git.mvaldes.dev/mvaldes/flux-test.git" -> null
      - created                     = "2023-11-23 13:28:47 -0600 -0600" -> null
      - default_branch              = "main" -> null
      - gitignores                  = "Go" -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_pull_requests           = true -> null
      - has_wiki                    = true -> null
      - html_url                    = "https://git.mvaldes.dev/mvaldes/flux-test" -> null
      - id                          = "21" -> null
      - ignore_whitespace_conflicts = true -> null
      - issue_labels                = "Default" -> null
      - migration_issue_labels      = true -> null
      - migration_milestones        = true -> null
      - migration_mirror_interval   = "8h0m0s" -> null
      - migration_releases          = true -> null
      - mirror                      = false -> null
      - name                        = "flux-test" -> null
      - permission_admin            = true -> null
      - permission_pull             = true -> null
      - permission_push             = true -> null
      - private                     = false -> null
      - repo_template               = false -> null
      - ssh_url                     = "ssh://git@git-ssh.local.net:2222/mvaldes/flux-test.git" -> null
      - updated                     = "2023-11-23 13:29:01 -0600 -0600" -> null
      - username                    = "mvaldes" -> null
    }

  # gitea_repository.this["k8s-apps"] will be created
+ resource "gitea_repository" "this" {
      + allow_manual_merge          = true
      + allow_merge_commits         = true
      + allow_rebase                = true
      + allow_rebase_explicit       = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + autodetect_manual_merge     = true
      + clone_url                   = (known after apply)
      + created                     = (known after apply)
      + default_branch              = "main"
      + gitignores                  = "default"
      + has_issues                  = true
      + has_projects                = true
      + has_pull_requests           = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + id                          = (known after apply)
      + ignore_whitespace_conflicts = true
      + issue_labels                = "Default"
      + migration_issue_labels      = true
      + migration_milestones        = true
      + migration_mirror_interval   = "8h0m0s"
      + migration_releases          = true
      + mirror                      = false
      + name                        = "k8s-apps"
      + permission_admin            = (known after apply)
      + permission_pull             = (known after apply)
      + permission_push             = (known after apply)
      + private                     = false
      + repo_template               = false
      + ssh_url                     = (known after apply)
      + updated                     = (known after apply)
      + username                    = "mvaldes"
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p gitea`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgitea%252Fgitea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p gitea`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`